//
//  MarketDataModel.swift
//  Cryptoo
//
//  Created by Андрей  on 11.05.2023.
//

import Foundation


// JSON Data:
/*
URL: https://api.coingecko.com/api/v3/global
 
JSON response:
 {
   "data": {
     "active_cryptocurrencies": 10723,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 739,
     "total_market_cap": {
       "btc": 43045431.44021449,
       "eth": 648173216.0843192,
       "ltc": 14529744809.438251,
       "bch": 10372568032.000486,
       "bnb": 3785938464.6569023,
       "eos": 1307610134138.8608,
       "xrp": 2781549986283.1772,
       "xlm": 13267844338050.191,
       "link": 183262879999.40677,
       "dot": 220947353573.36023,
       "yfi": 172539953.38599873,
       "usd": 1180534905937.0405,
       "aed": 4335059936114.9985,
       "ars": 269794134995774.22,
       "aud": 1753195861318.4128,
       "bdt": 126731281581752.6,
       "bhd": 445039229375.0491,
       "bmd": 1180534905937.0405,
       "brl": 5870445926753.121,
       "cad": 1586416973017.0647,
       "chf": 1052916721535.4336,
       "clp": 934393378049166.9,
       "cny": 8190433123900.6,
       "czk": 25361254304009.516,
       "dkk": 8042889871356.588,
       "eur": 1079776251715.312,
       "gbp": 937996370582.0853,
       "hkd": 9252316008046.596,
       "huf": 400960584693130.44,
       "idr": 17367023021529180,
       "ils": 4295434101462.3066,
       "inr": 96870255569947.02,
       "jpy": 157998659938442.6,
       "krw": 1568068489172444.5,
       "kwd": 361756033365.9106,
       "lkr": 372346048891921.56,
       "mmk": 2478107140520008,
       "mxn": 20832291509594.383,
       "myr": 5268137017744.051,
       "ngn": 545816728475479.3,
       "nok": 12465430985606.227,
       "nzd": 1860026006561.376,
       "php": 65725690620591.59,
       "pkr": 339994052909867.4,
       "pln": 4881495308560.991,
       "rub": 90764837156051.02,
       "sar": 4427336447037.5625,
       "sek": 12120622711349.94,
       "sgd": 1567437513334.3164,
       "thb": 39756479728583.086,
       "try": 23108469056382.527,
       "twd": 36287633738094.69,
       "uah": 43584668739089.87,
       "vef": 118206960131.47556,
       "vnd": 27702333032229244,
       "zar": 22743655437610.25,
       "xdr": 874586299179.4902,
       "xag": 47444387475.86399,
       "xau": 579394726.4848387,
       "bits": 43045431440214.49,
       "sats": 4304543144021449
     },
     "total_volume": {
       "btc": 2132172.828274149,
       "eth": 32106016.204519372,
       "ltc": 719703021.8519101,
       "bch": 513785249.14945763,
       "bnb": 187529195.40534574,
       "eos": 64769958267.44353,
       "xrp": 137778739875.717,
       "xlm": 657197203997.1884,
       "link": 9077575019.981121,
       "dot": 10944203089.763536,
       "yfi": 8546435.430953171,
       "usd": 58475530736.963936,
       "aed": 214728873552.16644,
       "ars": 13363734654737.406,
       "aud": 86841192040.03468,
       "bdt": 6277390794799.443,
       "bhd": 22044164052.75128,
       "bmd": 58475530736.963936,
       "brl": 290781271695.70056,
       "cad": 78580119910.7009,
       "chf": 52154208913.23661,
       "clp": 46283382578306.914,
       "cny": 405697384699.98236,
       "czk": 1256221055492.5837,
       "dkk": 398389112868.47656,
       "eur": 53484644188.56396,
       "gbp": 46461849898.116066,
       "hkd": 458295715269.1648,
       "huf": 19860812989619.984,
       "idr": 860242152432509.4,
       "ils": 212766083887.44907,
       "inr": 4798282184279.679,
       "jpy": 7826160369477.666,
       "krw": 77671262980137.6,
       "kwd": 17918890785.85078,
       "lkr": 18443446879263.918,
       "mmk": 122748280915884.83,
       "mxn": 1031887576016.8723,
       "myr": 260947055913.7019,
       "ngn": 27035984046048.324,
       "nok": 617451198674.8436,
       "nzd": 92132818243.01488,
       "php": 3255595936015.09,
       "pkr": 16840952852245.596,
       "pln": 241795500939.9161,
       "rub": 4495862001421.62,
       "sar": 219299613412.22098,
       "sek": 600371782608.2523,
       "sgd": 77640008803.0428,
       "thb": 1969260917801.4658,
       "try": 1144633662075.505,
       "twd": 1797438289500.9553,
       "uah": 2158882912903.0112,
       "vef": 5855154892.692183,
       "vnd": 1372181897007054,
       "zar": 1126563319665.046,
       "xdr": 43320953715.64157,
       "xag": 2350066672.479459,
       "xau": 28699205.73039446,
       "bits": 2132172828274.149,
       "sats": 213217282827414.9
     },
     "market_cap_percentage": {
       "btc": 44.99980578099367,
       "eth": 18.605886501618883,
       "usdt": 7.020747044903003,
       "bnb": 4.176855603298125,
       "usdc": 2.5470218011235297,
       "xrp": 1.8663970971860617,
       "ada": 1.0660905383056059,
       "steth": 0.9989624080113169,
       "doge": 0.8502475276209456,
       "sol": 0.6876137374366766
     },
     "market_cap_change_percentage_24h_usd": -2.0687731424063416,
     "updated_at": 1683810067
   }
 }
 */


struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
    
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
    
    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String {
        if let item = totalMarketCap.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc" }) {
            return item.value.asPersentString()
        }
        return ""
    }
}
